<script>
import Endmarker from "./endmarker.svelte";
import Mending from "./mending.svelte";
let isshowmending=false;
const showmending=(show)=>{
    isshowmending=show;
}
</script>
<div>
{#if isshowmending}
<button on:click={()=>showmending(false)}>項目介紹</button>
<Mending/>
{:else}
<button on:click={()=>showmending(true)}>補版計劃</button>
佛法是中華文明的三大組成部份(儒釋道)中唯一的非原生文明，佛經的翻譯和編修是大規模的文化交流工程，其在文明史的地位，不亞於阿拉伯的百年翻譯運動。
<br/>因此，以佛法為依托的文化符號，能夠將中華文明以較小的阻力，散播至儒家文化圈以外。
<br/>漢傳佛教徒素有勇於嘗試新科技的傳統，公元868年（唐咸通九年），在雕版印刷術萌芽之初，印行了金剛經（敦煌唐刻本），比歐洲早五百年。
<br/>日本於一百年前編修的大正藏，是近代較為齊全、廣為流通的版本。由於大正藏，以及收錄大量中國祖師著作的，卍續藏之成就，日本人可以自豪地宣稱，漢傳佛教的研究重心，已由中土轉移到東瀛。

<br/>生為炎黃子孫、身為三寶弟子，感謝日本為保存漢文佛經投入的努力，但以佛法流傳的角度而言，這是歷史的異常及脫軌(Abberation)，理由是：
<br/>一）大正藏係由學者主導，而自二千五百年前，佛陀入滅不久後的王舍城七葉窟結集以來，古今中外歷代翻譯編修佛經皆由僧團主持。
<br/><a href="https://www.daizoshuppan.jp/" target=_new>大蔵出版株式会社</a>以編製校勘產生的法律保障，不許他人販售該版佛經，這違反佛經自古以來自由公開的天然屬性。
<br/>而CBETA的大正藏授權來自於日本，換言之，任何在其上的加工與加值，都受相關著作權法的<a href="https://www.cbeta.org/copyright.php" target="_new">制約</a>。
<br/>二）佛經不能只是學者的研究材料，也不該是燙金精印、絲綢包裹但卻束之高閣的文物，必須是任何人都容易親近的結緣品。
<br/>我們無法容忍一家日本書商限制佛經流通方式，我們必須捍衛佛經「三根普被」的自由。
<br/><br/>如今我們擁有幾項前人難以想像的技術條件，正是打破這個尷尬局面的大好機會。
<br/>一）大正藏考察了多個佛經版本，將經文的差異製成校勘，節省了學者蒐集資料的時間，這是大正藏的核心價值。因為在紙本時代，不可能人人坐擁所有版本的佛經，校勘在某個意義上起到，同時參照多個版本的作用。
<br/>但校勘畢竟是二手資料，保真度遠不如原始文物，如今所有經文掃圖檔（公有財產）得以納入行動載具，只要建立了圖檔之間的對照關係，從任何一段經文可輕易地調閱所有版本的原始圖檔，校勘之重要性大減。
<br/>二）古代佛經主要是印度文明和中華文明（以及兩者幅射區域）的結晶，但受限於彼此高昂的交流成本（當年取經本身就是九死一生的冒險），其編製體例不可能有事先商議好的規範，這就造成各種版本和語系的佛經很難彼此參照驗證，也讓魚目混珠的現象難以杜絕與防犯。
<br/>三）將所有版本和譯本的佛經整合，統一參照系統的工作，我們稱之為「經同軌」，不止是經文目錄層級的對照（目錄提供某標題的各種版本和譯本的收錄情況及所在位置），而是更進一步做到每個句子的精準對應。
<br/>舉例來說，給定任何一句經文，電腦將有能力告知對應的原文以及各種譯文，反之亦然。即所謂的「平行語料庫」，這也是自然語言處理（如機器翻譯）的基礎材料。
<br/>四）「經同軌」，即佛經句子層級的對應，提供了比辭典更有效的學習材料，也可以化解辭典無法處理的語境(context)和多義(ambiguity) 關係。
<br/>閱讀古文難點不在查字典本身，而是查到之後，義項(senses)太多，挑選困難，一個句子只要有幾個生字，每個生字又有幾個可能的解釋，產生歧義的現象將呈指數上升。
<br/>五）近年來電腦越來越快，即使是手機也能以不到一秒以查找整部大藏經。於是瓶頸是使用者輸入文字的速度，以前是人等電腦，如今則是反過來。
<br/>因此，軟件的重點應該盡量掌握讀者所在的語境，做一些背景工作。舉例而言，讀者卡停在某個頁面，背景程式就開始搜羅彙整該頁的相關訊息，
<br/>即：這一頁有哪些艱澀名詞？哪些法師講過這段經文？哪些其他經文可以幫助閱讀理解這頁經文？
<br/>六）古代藏經雕刻耗費的人力物力極為驚人，從譯經、編輯團隊，到媒材的準備，抄寫刻字工，印刷及發行流通，是非常龐大的生產鏈。
<br/><br/>成功的藏經，至少有兩個必要條件，一是政權的同意，二是足夠的經費。皇帝未必真心信佛，和尚也未必服膺統治，但佛經想要存活，卷首少不了歌功頌德。
<br/>贊助刻經的，婦女是主力，後宮妃女的捐獻記錄，在藏經中保留很多。
<br/>台灣第一部大正藏，是孫張清揚（孫立人將軍夫人）變賣首飾，從日本運來的。
<br/>如今我們做手機版，也應該比照古人的辦法，將緇素二眾的護持事蹟編入藏經，我們這一代也作出了無愧先人、讓後人感念的貢獻。
<br/><br/>因此，我們決心以已成為人類公共財產的中土大藏經為基礎材料，從頭做起，初步計劃是：
<br/>一）以山東圖書館公布之十七萬拍「高清永樂北藏彩圖」為基礎，裁切成適合手機閱讀的50萬折（每拍三折）。每折5行，每行17字，共85個字。
<br/>二）以CBETA校對過的大正藏文字檔為工作底本，按永樂北藏的版式逐句重排，這樣就完全擺脫大正藏的製版權。加工成品採用最寬鬆的授權方式(CC0)，還佛經以最大的自由。
<br/>三）使用者點擊的圖檔任何一處、立即由軟體換算為對應的文字，可搜尋、查字典、連結原文、誦讀、顯示相關的開示錄影等。
<br/>四）取得諸山長老的祝福，我們的目標是只要會按手機，都可以悠遊法海。
<br/>五）由於沒有版權的限制，可以將此成果與置入商品平板電腦，贈與經濟欠發達地區的僧人，以做為國際文化交流的拌手禮。
{/if}
<Endmarker/>
</div>