<script>
import TofindHistory from './tofindhistory.svelte'
import {_} from './textout.js'
</script>
<TofindHistory/>
<hr/>
<div class="bodytext">
{_("點圖片任何一字，將短句帶入候選區，預設前三個字為關鍵字。")}
<br/>{_("點紅色背景的字，分享該段經文。")}
<br/>{_("♡書籤。閃爍時再點擊改變顏色，不閃爍時再點取消。")}
<br/>{_("點候選區改變關鍵的長度，同個位置再點一次，貼到輸入區。")}
<br/>{_("候選區與輸入區文字相同，再點候選區清除輸入區。")}
<br/>{_("搜尋結果：")}
<br/>{_("搜尋分頁為開頭為→的行，可以左右滑動翻頁，點擊翻下一頁。")}
<br/>{_("部類名右邊的紅色數字表示關鍵字出現次數，點擊顯示所有摘要行。")}
<br/>{_("點部類名統計標題內關鍵字出現次數，點出現次數顯示該章節內之摘要行。")}
<br/>{_("輸入時會顯示開頭符合、結尾符合或中間符合的推薦詞，點一下帶入候選區。")}
<br/>{_("從搜尋結果跳轉到本文，搜尋文字會加入記憶，最多二十組，超過刪去最初的記憶。按旁邊的紅色叉可刪除。")}
</div>