<div>
永樂藏：只是產品名稱，不是文獻學意義的藏經版本。
<br/>圖版：以山東圖書館藏永樂北藏為主，整卷缺漏或嚴重錯版（如增壹阿含卷23）改用同館永樂南藏，缺漏幾頁以乾隆大藏經補之。
<br/>文字：以CBETA為底本，只有字數不一致的情況才會修改，不保證與圖版一致。
不是永樂北藏、也不是大正藏的電子版，不適合作為嚴謹學術研究材料。只是為了方便搜尋。
<br/>標點：使用CBETA bookcase_v074_20221027 版經文的標點。
<br/>聲音：為節約帶寬降為48~96kpbs，需要原始音質，請打開「顯示油管影片連結」。
<br/>經錄：聲聞部份按照巴利聖典之順序，其餘經典大致按照大正藏的部類排列。
<br/>經號：四部阿含使用大正藏經號。
<hr/>
文件結構：
<br/>書號：英文字，agmm （中阿含經）
<br/>卷號：英文字加卷數，如agmm1。每卷對應一個圖版壓縮檔。
<br/>項號：對應到目次的一個項目。
<br/>段號：一段經文。也是雜阿含的一經。
<br/>文字檔的一行為一句經文、搜尋結果的最小顯示單元。
<hr/>
無量壽經句子對齊未完成。
</div>